app/views/teams/show.html.erb

SELECT `comments`.* FROM `comments`  WHERE `comments`.`team_id` = 4
---
<h2>Comments</h2>
<% @team.comments.each do |comment| %>