app/controllers/comments_controller.rb

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 4 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `team_id`, `updated_at`) VALUES ('YO', 'Jenna', '2014-09-30 04:33:09', 4, '2014-09-30 04:33:09')
---
  def create
    @team = Team.find(params[:team_id])
    @comment = @team.comments.create(comment_params)

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 4 LIMIT 1
SELECT  `comments`.* FROM `comments`  WHERE `comments`.`team_id` = 4 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @team = Team.find(params[:team_id])
    @comment = @team.comments.find(params[:id])
    @comment.destroy