app/controllers/players_controller.rb

  def create
    @team = Team.find(params[:team_id])
    @player = @team.players.create(player_params)
---
SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 13 LIMIT 1
INSERT INTO `players` (`created_at`, `name`, `team_id`, `updated_at`) VALUES ('2014-10-01 19:46:54', 'Jenna Tauro', 13, '2014-10-01 19:46:54')