app/controllers/teams_controller.rb

INSERT INTO `teams` (`created_at`, `name`, `text`, `updated_at`) VALUES ('2014-09-30 02:32:28', 'Blah', 'hi', '2014-09-30 02:32:28')
---
  def create
    @team = Team.new(team_params)

    if @team.save

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 6 LIMIT 1
---
  def show
  	@team = Team.find(params[:id])

SELECT `teams`.* FROM `teams`
---
  def index
    @teams = Team.all

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 8 LIMIT 1
---
  def edit
    @team = Team.find(params[:id])

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 8 LIMIT 1
UPDATE `teams` SET `text` = 'hello!!!!!!!', `updated_at` = '2014-09-30 03:13:52' WHERE `teams`.`id` = 8
---
  def update
  @team = Team.find(params[:id])

    if @team.update(team_params)

SELECT  `teams`.* FROM `teams`  WHERE `teams`.`id` = 1 LIMIT 1
DELETE FROM `teams` WHERE `teams`.`id` = 1
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy